Revit 2027 API
ContourSettingItem.SubCategoryId Property
 The contour line style subcategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SubCategoryId { get; }
Public ReadOnly Property SubCategoryId As ElementId
	Get
public:
property ElementId^ SubCategoryId {
	ElementId^ get ();
}
member SubCategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
ContourSettingItem Class
Autodesk.Revit.DB Namespace